# NonPlanView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SpanDirectionSymbolFailures..::..NonPlanView Property
BuiltInFailures..::..SpanDirectionSymbolFailures Class See Also
---
Span Direction Symbol can only be placed in a Floor Plan View.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonPlanView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonPlanView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonPlanView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SpanDirectionSymbolFailures Class
Autodesk.Revit.DB Namespace